[{"word":"life","type":"noun","pronunc":{"uk":{"mp3":"http://dictionary.cambridge.org/media/english/uk_pron/u/ukl/uklic/uklicen020.mp3","ogg":"http://dictionary.cambridge.org/media/english/uk_pron_ogg/u/ukl/uklic/uklicen020.ogg","text":"laɪf"},"us":{"mp3":"http://dictionary.cambridge.org/media/english/us_pron/l/lif/life_/life.mp3","ogg":"http://dictionary.cambridge.org/media/english/us_pron_ogg/l/lif/life_/life.ogg","text":"laɪf"}},"definitions":[{"definition":"the period between birth and death, or the experience or state of being alive: ","examples":["Life's too short to worry about money!"]},{"definition":"a way of living or a particular part of someone's life: ","examples":["her family/private/sex life"]},{"definition":"the period for which a machine or organization lasts: ","examples":["The newer batteries have a much longer life."]},{"definition":"the quality that makes people, animals, and plants different from objects, substances, and things that are dead: ","examples":["The doctor could find no sign of life in the old man's body."]},{"definition":"energy or enthusiasm: ","examples":["She's so full of life."]},{"definition":"everything that is alive: ","examples":["human/marine/plant life"]},{"definition":"In art, if you work from life, you paint, draw, etc. real people or objects, usually while they are in front of you rather than from memory: ","examples":["life drawing classes"]},{"definition":"especially in children's games, one of the limited number of times that you can lose, but still continue playing: ","examples":["Every time the little man gets hit, you lose a life."]},{"definition":"to make something more real or exciting: ","examples":["It's always been an interesting period in history and this film really brought it to life."]},{"definition":"to become more real or exciting: ","examples":["The game really came to life in the second half."]},{"definition":"for the whole of a person's life: ","examples":["I believe marriage is for life."]},{"definition":"to be willing to die in order to defend or support someone or something: ","examples":["They were ready to give their lives for their country."]},{"definition":"If you believe in life after death, you believe that people continue to exist in some form after they die."},{"definition":"to completely change how or where you live: ","examples":["She decided to start a new life in Australia."]}]}]