[{"word":"care","type":"noun","pronunc":{"uk":{"mp3":"http://dictionary.cambridge.org/media/english/uk_pron/u/ukc/ukcar/ukcardi010.mp3","ogg":"http://dictionary.cambridge.org/media/english/uk_pron_ogg/u/ukc/ukcar/ukcardi010.ogg","text":"keər"},"us":{"mp3":"http://dictionary.cambridge.org/media/english/us_pron/c/car/care_/care.mp3","ogg":"http://dictionary.cambridge.org/media/english/us_pron_ogg/c/car/care_/care.ogg","text":"ker"}},"definitions":[{"definition":"the process of protecting someone or something and providing what that person or thing needs: ","examples":["The standard of care at our local hospital is excellent."]},{"definition":"used as a combining form: ","examples":["skincare/healthcare/childcare"]},{"definition":"to protect someone or something and provide the things that that person or thing needs: ","examples":["Take good care of that girl of yours, Patrick - she's very special."]},{"definition":"Children who are in care or who have been taken/put into care are not living with their natural parents but instead with a national or local government organization or another family: ","examples":["Both children were taken into care when their parents died."]},{"definition":"a system in which people with mental illness or reduced mental ability are allowed to continue living in their own homes, with treatment and help, and are not kept in hospital"}]},{"word":"care","type":"verb","pronunc":{"uk":{"mp3":"http://dictionary.cambridge.org/media/english/uk_pron/u/ukc/ukcar/ukcardi010.mp3","ogg":"http://dictionary.cambridge.org/media/english/uk_pron_ogg/u/ukc/ukcar/ukcardi010.ogg","text":"keər"},"us":{"mp3":"http://dictionary.cambridge.org/media/english/us_pron/c/car/care_/care.mp3","ogg":"http://dictionary.cambridge.org/media/english/us_pron_ogg/c/car/care_/care.ogg","text":"ker"}},"definitions":[{"definition":"to think that something is important and to feel interested in it or upset about it: ","examples":["She's never cared very much about her appearance."]},{"definition":"used to emphasize rudely that you are not interested in or worried about something or someone: ","examples":["\"Mike's really fed up about it.\" \"I couldn't care less.\""]},{"definition":"used to say that you are not interested in or worried about what someone else is doing: ","examples":["You can go to the match with Paula, for all I care."]},{"definition":"used to say that you are not interested in or worried about something that has happened or that someone has said: ","examples":["He said he didn't approve of what I'd done, as if I cared."]},{"definition":"used to emphasize rudely that you do not think something is important: ","examples":["\"It looks as if we are going to lose.\" \"Who cares?\"."]}]}]