[{"word":"shake","type":"verb","pronunc":{"uk":{"mp3":"http://dictionary.cambridge.org/media/english/uk_pron/u/uks/uksex/uksexua030.mp3","ogg":"http://dictionary.cambridge.org/media/english/uk_pron_ogg/u/uks/uksex/uksexua030.ogg","text":"ʃeɪk"},"us":{"mp3":"http://dictionary.cambridge.org/media/english/us_pron/s/sha/shake/shake.mp3","ogg":"http://dictionary.cambridge.org/media/english/us_pron_ogg/s/sha/shake/shake.ogg","text":"ʃeɪk"}},"definitions":[{"definition":"to move backwards and forwards or up and down in quick, short movements, or to make something or someone do this: ","examples":["A young boy climbed into the apple tree and shook the branches so that the fruit fell down."]},{"definition":"If you are shaking, your body makes quick short movements, or you feel as if it is doing so, because you are frightened or nervous: ","examples":["She was shaking as she opened the letter."]},{"definition":"If your voice shakes, it makes you sound nervous or frightened: ","examples":["Her voice shook as she talked about the person who attacked her."]},{"definition":"to hold someone's hand and move it up and down, especially when you meet them for the first time or when you make an agreement with them: ","examples":["\"Pleased to meet you,\" he said, shaking my hand."]},{"definition":"If two people shake hands, they greet each other or say goodbye by briefly joining hands and moving them slightly up and down: ","examples":["The Princess was photographed shaking hands with AIDS victims."]},{"definition":"If two people shake (hands) on something, they make an agreement by briefly joining hands and moving them slightly up and down: ","examples":["It seems that we have a deal, so let's shake (hands) on it."]},{"definition":"to move your head from side to side, in order to express disagreement, sadness, or that you do not want or believe something: ","examples":["I asked Tim if he'd seen Jackie lately but he shook his head."]},{"definition":"to hold your hand up in the air with your fingers and thumb bent, and move it forcefully backwards and forwards, to show that you are angry: ","examples":["He shook his fist at the driver who pulled out in front of him."]}]},{"word":"shake","type":"noun","pronunc":{"uk":{"mp3":"http://dictionary.cambridge.org/media/english/uk_pron/u/uks/uksex/uksexua030.mp3","ogg":"http://dictionary.cambridge.org/media/english/uk_pron_ogg/u/uks/uksex/uksexua030.ogg","text":"ʃeɪk"},"us":{"mp3":"http://dictionary.cambridge.org/media/english/us_pron/s/sha/shake/shake.mp3","ogg":"http://dictionary.cambridge.org/media/english/us_pron_ogg/s/sha/shake/shake.ogg","text":"ʃeɪk"}},"definitions":[{"definition":"an act of shaking something: ","examples":["She gave the box a shake to see if there was anything inside it."]},{"definition":"short, quick movements from side to side that your body makes because you are ill, are frightened, or have drunk too much alcohol: ","examples":["I watched her hands as she prepared coffee and she definitely had the shakes."]},{"definition":"a  milkshake "}]}]